app/controllers/orders_controller.rb

SELECT  1 AS one FROM "line_items" WHERE "line_items"."cart_id" = ? LIMIT 1  [["cart_id", 2]]
SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = ?  [["cart_id", 2]]
---
  def new
    if @cart.line_items.empty?

INSERT INTO "orders" ("name", "address", "email", "pay_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "sss"], ["address", "111-111\r\nddfe"], ["email", "aaa@aaaa"], ["pay_type", "Credit Card"], ["created_at", "2015-09-02 15:44:51.016004"], ["updated_at", "2015-09-02 15:44:51.016004"]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 2]]
---
  def create
    @order = Order.new(order_params)
    @order.add_line_items_from_cart(@cart)

    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])