app/controllers/products_controller.rb

INSERT INTO "products" ("title", "description", "image_url", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

UPDATE "products" SET "image_url" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["image_url", "ruby.jpg"], ["updated_at", "2015-08-22 15:55:42.208549"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)